cases/artigo_mestrado/old/on-fsi-2-Pc9034/fluid/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// LCR no SAS estatico: Re << 1, sem turbulencia.
simulationType   laminar;
